nanoframework/nf-interpreter/targets/FreeRTOS_ESP32/ESP32_WROOM_32/nanoCLR/targetHAL_ConfigurationManager.cpp
    // Init pointers to cert bundles to 0 ( not allocated )
    for (uint32_t index = 0; index < certificateCount; index++)
    {
        g_TargetConfiguration.DeviceCertificates->Certificates[index] = 0;
    }
}

bool StoreConfigBlock(
    DeviceConfigurationOption configType,
    uint32_t configurationIndex,
    void *pConfigBlock,
    size_t writeSize)
{
    bool result = false;
    uint32_t fileHandle;

    fileHandle = Config_OpenFile(configType, configurationIndex, true);
    if (fileHandle != CONFIG_ERROR)
    {
        result = Config_WriteFile(fileHandle, (uint8_t *)pConfigBlock, writeSize);
#ifdef DEBUG_CONFIG
        ets_printf(
            "store type %d index %d, length %d result %d\n",
            (int)configType,
            configurationIndex,
            writeSize,
            (int)result);
#endif
        Config_CloseFile(fileHandle);
    }

    return result;
}

// Enumerates the configuration blocks from the configuration flash sector
// it's implemented with 'weak' attribute so it can be replaced at target level if a different persistance mechanism is
// used
void ConfigurationManager_EnumerateConfigurationBlocks()
{
    // Fix adapter counts -  will get these from NVS
    // Still need to do wireless AP
    int networkCount = 3; // Esp32 has 3 network interfaces, Ethernet, Wireless Station & Wireless APn
    int wirelessCount = 1;
    int wirelessAPCount = 1;
    int certificateCount = 1;
    int deviceCertificateCount = 1;

    // Allocate main structures for each type
    ConfigurationManager_allocate_network(networkCount);
    ConfigurationManager_allocate_wireless(wirelessCount);
    ConfigurationManager_allocate_wirelessAP(wirelessAPCount);
    ConfigurationManager_allocate_certificates(certificateCount);
    ConfigurationManager_allocate_device_certificates(deviceCertificateCount);

    // For each network interface allocate Network config if required and load from storage
    for (int configIndex = 0; configIndex < networkCount; configIndex++)
    {
        if (g_TargetConfiguration.NetworkInterfaceConfigs->Configs[configIndex] == 0)
        {
            g_TargetConfiguration.NetworkInterfaceConfigs->Configs[configIndex] =
                (HAL_Configuration_NetworkInterface *)platform_malloc(sizeof(HAL_Configuration_NetworkInterface));
        }

        if (ConfigurationManager_GetConfigurationBlockFromStorage(
                DeviceConfigurationOption_Network,
                configIndex,
                g_TargetConfiguration.NetworkInterfaceConfigs->Configs[configIndex],
                sizeof(HAL_Configuration_NetworkInterface)) == false)
        {
            // No config saved so init default block
            HAL_Configuration_NetworkInterface *configPtr =
                g_TargetConfiguration.NetworkInterfaceConfigs->Configs[configIndex];
            InitialiseNetworkDefaultConfig(configPtr, configIndex);
            StoreConfigBlock(
                DeviceConfigurationOption_Network,
                configIndex,
                configPtr,
                sizeof(HAL_Configuration_NetworkInterface));
        }
    }

    g_TargetConfiguration.NetworkInterfaceConfigs->Count = networkCount;

    // For each Wireless interface allocate Wireless config if required and load from storage
    for (int configIndex = 0; configIndex < wirelessCount; configIndex++)
    {
        if (g_TargetConfiguration.Wireless80211Configs->Configs[configIndex] == 0)
        {
            g_TargetConfiguration.Wireless80211Configs->Configs[configIndex] =
                (HAL_Configuration_Wireless80211 *)platform_malloc(sizeof(HAL_Configuration_Wireless80211));
        }
        if (ConfigurationManager_GetConfigurationBlockFromStorage(
                DeviceConfigurationOption_Wireless80211Network,
                configIndex,
                g_TargetConfiguration.Wireless80211Configs->Configs[configIndex],
                sizeof(HAL_Configuration_Wireless80211)) == false)
        {
            HAL_Configuration_Wireless80211 *configPtr =
                g_TargetConfiguration.Wireless80211Configs->Configs[configIndex];
            InitialiseWirelessDefaultConfig(configPtr, configIndex);
            StoreConfigBlock(
                DeviceConfigurationOption_Wireless80211Network,
                configIndex,
                configPtr,
                sizeof(HAL_Configuration_Wireless80211));
        }
    }
    g_TargetConfiguration.Wireless80211Configs->Count = wirelessCount;

    // For each Wireless AP interface allocate Wireless AP config if required and load from storage
    for (int configIndex = 0; configIndex < wirelessAPCount; configIndex++)
    {
        if (g_TargetConfiguration.WirelessAPConfigs->Configs[configIndex] == 0)
        {
            g_TargetConfiguration.WirelessAPConfigs->Configs[configIndex] =
                (HAL_Configuration_WirelessAP *)platform_malloc(sizeof(HAL_Configuration_WirelessAP));
        }
        if (ConfigurationManager_GetConfigurationBlockFromStorage(
                DeviceConfigurationOption_WirelessNetworkAP,
                configIndex,
                g_TargetConfiguration.WirelessAPConfigs->Configs[configIndex],
                sizeof(HAL_Configuration_WirelessAP)) == false)
        {
            HAL_Configuration_WirelessAP *configPtr = g_TargetConfiguration.WirelessAPConfigs->Configs[configIndex];
            InitialiseWirelessAPDefaultConfig(configPtr, configIndex);
            StoreConfigBlock(
                DeviceConfigurationOption_WirelessNetworkAP,
                configIndex,
                configPtr,
                sizeof(HAL_Configuration_WirelessAP));
        }
    }
    g_TargetConfiguration.WirelessAPConfigs->Count = wirelessCount;

    // For each Certificate bundle allocate memory and load from storage
    for (int certificateIndex = 0; certificateIndex < certificateCount; certificateIndex++)
    {
        // Free any existing bundles first, we need to reallocate as bundles are variable size
        if (g_TargetConfiguration.CertificateStore->Certificates[certificateIndex] != 0)
        {
            platform_free(g_TargetConfiguration.CertificateStore->Certificates[certificateIndex]);
            g_TargetConfiguration.CertificateStore->Certificates[certificateIndex] = 0;
        }

        // Find size of saved cert bundle
        int32_t bundleSize = ConfigurationManager_FindConfigurationBlockSize(
            DeviceConfigurationOption_X509CaRootBundle,
            certificateIndex);
        if (bundleSize > 0)
        {
            // Bundle exits
            g_TargetConfiguration.CertificateStore->Count = certificateIndex + 1;
            g_TargetConfiguration.CertificateStore->Certificates[certificateIndex] =
                (HAL_Configuration_X509CaRootBundle *)platform_malloc(bundleSize);
            ConfigurationManager_GetConfigurationBlockFromStorage(
                DeviceConfigurationOption_X509CaRootBundle,
                certificateIndex,
                g_TargetConfiguration.CertificateStore->Certificates[certificateIndex],
                bundleSize);
        }
    }

