nanoframework/nf-interpreter/targets/FreeRTOS_ESP32/ESP32_WROOM_32/nanoCLR/targetHAL_ConfigurationManager.cpp
    // copy the config block content to the pointer in the argument
    memcpy(configurationBlock, blockAddress, sizeOfBlock);

    return TRUE;
}

DeviceConfigurationOption GetConfigOption(char *pConfig)
{
    switch (*pConfig)
    {
        case CONFIG_TYPE_NETWORK:
            return DeviceConfigurationOption::DeviceConfigurationOption_Network;
        case CONFIG_TYPE_WIRELESS:
            return DeviceConfigurationOption::DeviceConfigurationOption_Wireless80211Network;
        case CONFIG_TYPE_WIRELESSAP:
            return DeviceConfigurationOption::DeviceConfigurationOption_WirelessNetworkAP;
        case CONFIG_TYPE_CERTIFICATE:
            return DeviceConfigurationOption::DeviceConfigurationOption_X509CaRootBundle;
    }
    return DeviceConfigurationOption_Network;
}

bool ConfigurationManager_StoreConfigurationBlockAll(void *configurationBlock, uint32_t blockSize, uint32_t offset)
{
    size_t chunkSize = 0;
    uint32_t certificateIndex = 0;
    bool result = false;
    uint32_t configurationIndex = 0;

    // All configuration blocks in one block
    // Separate and update

#ifdef DEBUG_CONFIG
    ets_printf("Block size %d\n", blockSize);

    ets_printf("sizeof HAL_Configuration_NetworkInterface %d\n", sizeof(HAL_Configuration_NetworkInterface));
    ets_printf("sizeof HAL_Configuration_Wireless80211 %d\n", sizeof(HAL_Configuration_Wireless80211));
    ets_printf("sizeof of X509Certificate varies\n");
#endif

    configurationIndex = 0;

    char *pConfig = (char *)configurationBlock;
    char *pEndConfig = (pConfig + blockSize);
    DeviceConfigurationOption currentConfigType;

    while (pConfig < pEndConfig)
    {
        int remainingBlockSize = pEndConfig - pConfig;

#ifdef DEBUG_CONFIG
        ets_printf("Parse block %d:%d\n", pConfig, pEndConfig);
        PrintBlock((char *)pConfig, 16);
#endif
        currentConfigType = GetConfigOption(pConfig);

        // X509 certificate block ?
        if (currentConfigType == DeviceConfigurationOption_X509CaRootBundle || offset > 0)
        {
            if (offset == 0)
            {
                HAL_Configuration_X509CaRootBundle *pX509Certificate = (HAL_Configuration_X509CaRootBundle *)pConfig;

                // First block of certificate bundle
                // set total bundle size including header
                // because X509 certificate has a variable length need to compute the block size in two steps
                savedBundleSize = offsetof(HAL_Configuration_X509CaRootBundle, Certificate);
                savedBundleSize += pX509Certificate->CertificateSize;
                remainingBundleSize = savedBundleSize;
                savedBundleOffset = 0;

                // Free if already allocated ( could be different size )
                if (g_TargetConfiguration.CertificateStore->Certificates[certificateIndex] != 0)
                    platform_free((void *)g_TargetConfiguration.CertificateStore->Certificates);

                g_TargetConfiguration.CertificateStore->Certificates[certificateIndex] =
                    (HAL_Configuration_X509CaRootBundle *)platform_malloc(savedBundleSize);

#ifdef DEBUG_CONFIG
                ets_printf("X509 certificate block total size:%d\n", pX509Certificate->CertificateSize);
#endif
            }

            // The current chunk size is what remains in current block
            // we can't use offset as it relates to flash memory offset, not useful
            chunkSize = remainingBlockSize;

            // Copy into correct position in memory
            memcpy(
                (void *)(g_TargetConfiguration.CertificateStore->Certificates[0] + savedBundleOffset),
                (const void *)pConfig,
                chunkSize);
#ifdef DEBUG_CONFIG
            ets_printf("X509 certificate chunksize:%d reminaing:%d\n", chunkSize, savedBundleSize);
            PrintBlock((char *)pConfig, 32);
#endif
            pConfig += chunkSize;
            remainingBundleSize -= chunkSize;
            savedBundleOffset += chunkSize;
            // Return true for partial blocks
            result = true;

            if (remainingBundleSize <= 0)
            {
                // Save Certificate Bundle to storage
                result = StoreConfigBlock(
                    DeviceConfigurationOption_X509CaRootBundle,
                    certificateIndex,
                    (void *)g_TargetConfiguration.CertificateStore->Certificates[certificateIndex],
                    savedBundleSize);
                certificateIndex++;
#ifdef DEBUG_CONFIG
                ets_printf("X509 certificate complete, saving\n");
#endif
            }

#ifdef DEBUG_CONFIG
            ets_printf("X509 certificate block ret:%d\n", result);
#endif
        }
        // Network interface block ?
        else if (currentConfigType == DeviceConfigurationOption_Network)
        {
            HAL_Configuration_NetworkInterface *pNetConfig = (HAL_Configuration_NetworkInterface *)pConfig;
            pConfig += sizeof(HAL_Configuration_NetworkInterface);

            result = StoreConfigBlock(
                currentConfigType,
                configurationIndex,
                (void *)pNetConfig,
                sizeof(HAL_Configuration_NetworkInterface));
            configurationIndex++;

#ifdef DEBUG_CONFIG
            ets_printf("Network block %X %X ret:%d\n", pNetConfig->InterfaceType, pNetConfig->SpecificConfigId, result);
            PrintBlock((char *)pNetConfig, sizeof(HAL_Configuration_NetworkInterface));
#endif
        }
        // Wireless block ?
        else if (currentConfigType == DeviceConfigurationOption_Wireless80211Network)
        {
            HAL_Configuration_Wireless80211 *pWirelessConfig = (HAL_Configuration_Wireless80211 *)pConfig;
            pConfig += sizeof(HAL_Configuration_Wireless80211);

            result = StoreConfigBlock(
                currentConfigType,
                pWirelessConfig->Id,
                (void *)pWirelessConfig,
                sizeof(HAL_Configuration_Wireless80211));

#ifdef DEBUG_CONFIG
            ets_printf(
                "Wireless block %d ssid:%s password:%s ret:%d\n",
                pWirelessConfig->Id,
                pWirelessConfig->Ssid,
                pWirelessConfig->Password,
                result);
            PrintBlock((char *)pWirelessConfig, sizeof(HAL_Configuration_Wireless80211));
#endif
        }
        else
            break;
    } // while

#ifdef DEBUG_CONFIG
    ets_printf("StoreConfig ALL exit %d\n", (int)result);
#endif
    return result;
}

//
// Stores the configuration block to the storage
//
// Parameters:-
//   configurationBlock : Pointer to block to store
//   configuration      : Type of configuration block to store or All for block with multiple types
//   configurationIndex : Index of type to store ( not used for All )
//   blockSize          : Size of data pointed to by configurationBlock
//   offset             : Offset of data when multiple blocks ( currently Certificate Bundles only ), For single type
//   this is offset withing the type
//                        For ALL type blocks this is the offset in the total data of multiple types.
// Return:-
//    true - OK
//    false- Error/Not found
//
bool ConfigurationManager_StoreConfigurationBlock(
    void *configurationBlock,
    DeviceConfigurationOption configuration,
    uint32_t configurationIndex,
    uint32_t blockSize,
    uint32_t offset,
    bool done)
{
    bool result = false;
    bool requiresEnumeration = false;

#ifdef DEBUG_CONFIG
    ets_printf(
        "StoreConfig config:%d, index:%d  size:%d  offset:%d\n",
        (int)configuration,
        configurationIndex,
        blockSize,
        offset);
#endif

    if (configuration == DeviceConfigurationOption_All)
    {
        result = ConfigurationManager_StoreConfigurationBlockAll(configurationBlock, blockSize, offset);

